<?php
    echo "Вариант 3\n
Написать программу для игры в \"Виселица\" (hangman). \n
Компьютер загадывает слово из шести букв (список возможных слов нужно заранее сгенерировать и сохранить в базе данных)\n
рисует на странице отдельные пустые клетки для каждой буквы. Игрок пытается угадать буквы, а затем и все слово целиком.\n
Если игрок правильно угадывает букву, компьютер вписывает ее в клетку. Если ошибается, то рисует одну из частей тела\n
повешенного человека (использовать псевдографику). Чтобы победить, игрок должен угадать все буквы в слове до того, как\n
повешенный человечек будет полностью нарисован.

Псевдографика для игры:
+---+    +---+    +---+    +---+    +---+    +---+    +---+
    |    0   |    0   |    0   |    0   |    0   |    0   |
    |        |    |   |   /|   |   /|\  |   /|\  |   /|\  |
    |        |        |        |        |   /    |   / \  |
   ===      ===      ===      ===      ===      ===      ===

Информация о датах и исходах всех партий, а также о всех попытках, сделанных во время игры, должна сохраняться в базе данных SQLite.

Для каждой партии в базе должна храниться следующая информация:\n
    \tДата игры\n
    \tИмя игрока\n
    \tЗагаданное компьютером слово\n
    \tИсход игры (угадал/не угадал)\n
    \tЗапись попыток в формате: номер попытки | предложенная буква | результат\n

В программе должны быть реализованы три режима, которым соответствуют ключи:\n
    \t--new. Новая игра.\n
    \t--list. Вывод списка всех сохраненных партий.\n
    \t--replay id. Повтор игры с идентификатором id.\n";
?>
